app/controllers/posts_controller.rb

  def create
    @post = Post.new(content: params[:content])
    if @post.save
---
INSERT INTO "posts" ("content", "created_at", "updated_at") VALUES (?, ?, ?)  [["content", "aaa"], ["created_at", "2021-07-17 22:49:20.988678"], ["updated_at", "2021-07-17 22:49:20.988678"]]