app/controllers/users_controller.rb

INSERT INTO "users" ("name", "created_at", "updated_at", "password", "image_name") VALUES (?, ?, ?, ?, ?)  [["name", "あ"], ["created_at", "2021-07-27 12:38:57.730451"], ["updated_at", "2021-07-27 12:38:57.730451"], ["password", "aa"], ["image_name", "default_user.jpg"]]
---
  def create
    @user = User.new(
      name: params[:name],
      image_name: "default_user.jpg",
      password: params[:password]
    )
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "bbb"], ["updated_at", "2021-07-23 13:45:34.316871"], ["id", 10]]
---
  def update
    @user = User.find_by(id: params[:id])
    @user.name = params[:name]
    if @user.save