app/controllers/users_controller.rb

  def create
    @user=User.new(name: params[:name])
    @user.save
---
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "B"], ["created_at", "2021-07-21 07:06:10.431598"], ["updated_at", "2021-07-21 07:06:10.431598"]]